Revit 2024 API
StickElementExtension Enumeration
 Presets for given Analytical Extension.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum StickElementExtension
Visual Basic
<ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")> _
Public Enumeration StickElementExtension
Visual C++
[ObsoleteAttribute(L"This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum class StickElementExtension
Members
Member name | Description
BottomOrTop |  Bottom or Top of physical element.
ReferenceLevel |  Bottom or top Reference Level.
Plane |  Use a Plane for extension (e.g., Grid, Level).
Varies |  Extension types are different at each end.
See Also
Autodesk.Revit.DB.Structure Namespace